; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	image2 - mode
	image3 - mode
	thermograph4 - mode
	image0 - mode
	infrared5 - mode
	thermograph1 - mode
	GroundStation8 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Star5 - direction
	Star1 - direction
	GroundStation2 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 image3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star4)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument5 thermograph1)
	(supports instrument5 image3)
	(supports instrument5 infrared5)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star5)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(have_image Planet9 image3)
	(have_image Phenomenon10 thermograph4)
	(have_image Star11 image3)
	(have_image Star11 thermograph4)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 image2)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 7
2. (turn_to satellite1 groundstation0 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon12 instrument2 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 7
9. (turn_to satellite0 phenomenon10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
10. (take_image satellite0 phenomenon10 instrument0 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 3 of 7
11. (turn_to satellite0 planet9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet9)
   goals met: 3 of 7
12. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 4 of 7
13. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
14. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 5 of 7
15. (take_image satellite0 star11 instrument0 thermograph4)
   added: (have_image star11 thermograph4)
   goals met: 6 of 7
16. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 7
17. (take_image satellite1 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 7 of 7
